c5/src/DataProcessors/ExchangeData/ExchangeData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ExchangeData</name>
</mdclass:DataProcessor>

c5/src/Catalogs/Exchange/Exchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Exchange</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>EMailLoad</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>EMailUnLoad</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>FileMessage</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FileRules</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FileRulesClassifiers</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadScheduledJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPClient</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPClientJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InformationRules</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InformationRulesClassifiers</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LastDateLoad</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastDateUnload</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastExchange</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>MaximumErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Node</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>NumbersOfErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OperationType</name>
    <type>
      <types>EnumRef.ExchangeTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PasswordEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Periodicity</name>
    <type>
      <types>EnumRef.ExchangePeriodicity</types>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPUnLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortPOP3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PrefixFileName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegisterInSequenceCost</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Rules</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>RulesClassifiers</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>SendedEMailError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SendEMailErrors</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPLoad</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPUnLoad</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerPOP3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerTimeOut</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UpdateConfiguration</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAutomatic</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseClassifiers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UserEmail</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserTenant</name>
    <type>
      <types>CatalogRef.Users</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseRules</name>
    <type>
      <types>EnumRef.ExchangeRules</types>
    </type>
  </attributes>
  <attributes>
    <name>UseRulesClassifiers</name>
    <type>
      <types>EnumRef.ExchangeRules</types>
    </type>
  </attributes>
  <attributes>
    <name>UserWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseSSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseStandartFTPClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WebService</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Receivers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/DataProcessors/ExchangeData/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure Unload ( Params ) export
	
	processor ().Unload ( Params );
	
EndProcedure

Procedure Load ( Params ) export
	
	processor ().Load ( Params );
	
EndProcedure

Function processor ()
	
	return DataProcessors.ExchangeData.Create ();
	
EndFunction

Procedure RereadData () export
	
	Output.StartReReadData ();
	str = "
	|select top 1 Catalog.Ref as CatalogItem, Catalog.Node as Node, Catalog.FileMessage as FileMessage
	|from Catalog.Exchange as Catalog
	|where Catalog.Node = &MasterNode
	|";
	query = new Query ( str );
	query.SetParameter ( "MasterNode", ExchangePlans.MasterNode () );
	result = query.Execute ();
	if ( result.IsEmpty () ) then
		// ...
	else
		selection = result.Select ();
		selection.Next ();
		if ( selection.FileMessage <> "" ) then
			id = "";
			try
				fileXML = new File ( selection.FileMessage );
				id = Left ( Right ( fileXML.Path, 37 ), 36 );
			except
				return;
			endtry;
			Output.ExchangeLoadingAgain ( new Structure ( "Node, ID", selection.Node, id ) );
			p = new Structure ();
			p.Insert ( "Node", selection.CatalogItem );
			p.Insert ( "StartUp", false );
			p.Insert ( "Update", true );
			p.Insert ( "ID", id );
			Output.ReReadLoad ();
			Load ( p );
			Output.ReReadUnLoad ();
			UnLoad ( p );	
		endif;
	endif;
	Output.CloseCurrentSession ();
	Connections.DisconnectMe ();
	
EndProcedure

#endif
